{
  "jungle_warriors_description": "It is a first-person action game that is performed in UDK engine for 2 years. As a technical supervisor and developer, I worked on this project. Although our team faced so many new difficult issues, I tried hard so I could solve many of them and help my teammates to go further in our technical work.",
  "catch_the_monster_description": "This game was developed for Android-powered devices in the Memory Match format. The story of the game is about the monsters attack to earth who come to earth by hiding their faces. The user is supposed to find them in the game. At the beginning of each stage, the user sees the face of the targeted monster then he should find them in different rows of faces. This game can be played in single and dual steps on a mobile device. At that time, due to the fact that the game was one of the earliest Android games, it was analyzed by the Android Smoching channel.",
  "little_scientists_description": "For Android devices, it is a puzzle game that the user is supposed to solve physics problems to pass the game levels actually the game is about a kangaroo family whose children are kidnapped by aliens, and the user should use the rules of physics to save the kangaroos.",
  "speedy_snake_description": "For the Android devices and in the Infinity runner style. The user as a snake with the device accelerometer is supposed to pass the obstacles ahead and get the highest record.",
  "khabar_24_description": "This app delivers news headlines from various newsstands three times a day (morning, afternoon, night). The app was written for Android phones and got 30,000 installs. It also became the top three popular newsstands at Café Bazaar at that time.",
  "pixelo_description": "A guessing game in which the user is supposed to  guess the pixelated Image of celebrities. The game was made for Android phones.",
  "marmoolak_description": "A guess the words game that user can compete with AI or compete with someone else online. The game has a randomly keyboard of the letters given to the user for making a meaningful word with more than three letters. This game became so popular at Café Bazaar, and ranked as the top game several times, with the total installation of nearly 50,000 times. The game was built for the Android platform.",
  "joojoo_shoot_description": "The story of a chicken, which runs away when his mother is falling asleep, but his father finds him and tries to return him back to their nest. The gameplay is aiming and shooting the chicken to nest. The number of levels is infinite, with a random mechanism of the gameplay. This game is made for Android devices.",
  "happy_soccer_description": "A new kind of soccer game on board and dice. The game is turn-based, and in each stage, two dice are given to the user, one is the number of movable players and the other determines the number of moves. Due to the fact that this game is the first game in this genre, it has been completed in various test methods and gameplay.",
  "happy_runner_description": "Happy Runner is an infinite runner game in which the user selects and controls a character and must pass the obstacles and collect coins and get a better record each time.",
  "fighter_jet_description": "The user controls a jet in this game and goes on. He is supposed to destroy enemies that come across with a shotgun and missiles. The camera's view of the game is from above. In the single-player section, he can fight online and in the two-part division he can destroy the enemies as a team with another user.",
  "shater_description": "This game is a brand new Infinite Runner game in which the user runs on a cylindrical ground with various obstacles that are randomly generated and moved. He must pass these obstacles without any hesitation and reach the highest record. This game is for the Android platform.",
  "jazireh_description": "This app is a virtual supermarket with specific features that the user can buy a variety of products and get some score by purchasing them. Since the users in this app are tree-like, at the end they can purchase by these scores or convert them to money.",
  "superior_memory_description": "It is a game for finding the same pair picture. This game is for Android and iOS platforms and has nearly ten thousand users. One part of the game is competition among users. If the user is among top ten players from Saturday to Wednesday, they can compete with others on the final day which is Thursday and they will receive prizes if they win.",
  "mini_football_description": "This game is similar to the Soccer Stars game that users compete online. The game has several different pitches for the match, each with different coins and each winner will receive coins and eventually coins can be converted into real money.",
  "zanboori_description": "Guess the words game style. The user is given some letters to find meaningful words in the number of letters that is needed.",
  "words_war_tanks_battle_description": "You control a tank that faces different enemy tanks and you must destroy them all! But in order to fire at your enemy, you have to look for meaningful words among the letters given to you. You can play with AI in campaign mode or against another person as opponent.",
  "virtual_exhibition_description": "This is a virtual exhibition that I recently developed. all data for halls and booths fetched from the server with rest API and in the selected hall booth's textures filled with URLs. I built Windows, WebGL, and Android versions of this VE.",
  "magic_defence_description": "Magic Defence is a PvP Tower Defense game that you should destroy monsters with dice towers. there are PVP and Co-op modes and more than 40 types of dices. dices can be upgraded too. I developed all parts of the client-side except the gameplay scene with Unity3d and C# also server-side with Node.js and MongoDB. The connection between clients and server is with secure Socket.io and data is encrypted."
}